app/Models/CategoryModel.php

    public function getCategories(){
            return $this->findAll();
---
SELECT *
FROM `category`

    public function getSpecificCategories($parent_id = NULL){
            return $this->asArray()->where('parent_id' , $parent_id)->findAll();
---
SELECT *
FROM `category`
WHERE `parent_id` IS NULL